<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"7308eb87923f3134319559f3109673d231bc3c7f87bc0b94dc02432719fd0812","plan_job_ref":"Job Plan Airflow DAGs #229 at https://github.com/cal-itp/data-infra/actions/runs/16207209362","plan_out_hash":"b32a7dddc65004ba7bfad0acd22cd51821bf75d181e83dd8e3383b58eb2a9f6c","plan_hash":"e8c2c4a54723cd6a230f878e5bf923398a056842f26cec4460e6892d144f5570","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 2 to add, 5 to change, 16 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/cosmos_nonpayment_dag.py"] will be destroyed
  # (because key ["dags/cosmos_nonpayment_dag.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "iIW6Cw==" -> null
-       detect_md5hash      = "2k0nIiXzwzBVuNWCKJN/EA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751485822739395 -> null
-       id                  = "calitp-staging-composer-dags/cosmos_nonpayment_dag.py" -> null
-       md5hash             = "2k0nIiXzwzBVuNWCKJN/EA==" -> null
-       md5hexhash          = "da4d272225f3c33055b8d58228937f10" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fcosmos_nonpayment_dag.py?generation=1751485822739395&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/cosmos_nonpayment_dag.py" -> null
-       output_name         = "dags/cosmos_nonpayment_dag.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fcosmos_nonpayment_dag.py" -> null
-       source              = "../../../../airflow/dags/cosmos_nonpayment_dag.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/cosmos_payment_dag.py"] will be destroyed
  # (because key ["dags/cosmos_payment_dag.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "XwE79g==" -> null
-       detect_md5hash      = "ruy3WFT/ywTuhBeF2hnumQ==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751387626800675 -> null
-       id                  = "calitp-staging-composer-dags/cosmos_payment_dag.py" -> null
-       md5hash             = "ruy3WFT/ywTuhBeF2hnumQ==" -> null
-       md5hexhash          = "aeecb75854ffcb04ee841785da19ee99" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fcosmos_payment_dag.py?generation=1751387626800675&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/cosmos_payment_dag.py" -> null
-       output_name         = "dags/cosmos_payment_dag.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fcosmos_payment_dag.py" -> null
-       source              = "../../../../airflow/dags/cosmos_payment_dag.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_all_dag.py"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/dbt_all_dag.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/dbt_all_dag.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_payments_dag.py"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/dbt_payments_dag.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/dbt_payments_dag.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/METADATA.yml"] will be destroyed
  # (because key ["dags/transform_warehouse/METADATA.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "rTxPwQ==" -> null
-       detect_md5hash      = "gDxdrL5o3VaeoUG5BuT9MA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1752012528714363 -> null
-       id                  = "calitp-staging-composer-dags/transform_warehouse/METADATA.yml" -> null
-       md5hash             = "gDxdrL5o3VaeoUG5BuT9MA==" -> null
-       md5hexhash          = "803c5dacbe68dd569ea141b906e4fd30" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2FMETADATA.yml?generation=1752012528714363&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/transform_warehouse/METADATA.yml" -> null
-       output_name         = "dags/transform_warehouse/METADATA.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2FMETADATA.yml" -> null
-       source              = "../../../../airflow/dags/transform_warehouse/METADATA.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/README.md"] will be destroyed
  # (because key ["dags/transform_warehouse/README.md"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "N2yy8Q==" -> null
-       detect_md5hash      = "EXnXdklhVCT6NExeUhuCRw==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751485822828985 -> null
-       id                  = "calitp-staging-composer-dags/transform_warehouse/README.md" -> null
-       md5hash             = "EXnXdklhVCT6NExeUhuCRw==" -> null
-       md5hexhash          = "1179d77649615424fa344c5e521b8247" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2FREADME.md?generation=1751485822828985&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/transform_warehouse/README.md" -> null
-       output_name         = "dags/transform_warehouse/README.md" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2FREADME.md" -> null
-       source              = "../../../../airflow/dags/transform_warehouse/README.md" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"] will be destroyed
  # (because key ["dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "BasEhQ==" -> null
-       detect_md5hash      = "eosxYzjG9L4u4S5IV0f/1A==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751485822740512 -> null
-       id                  = "calitp-staging-composer-dags/transform_warehouse/dbt_run_and_upload_artifacts.yml" -> null
-       md5hash             = "eosxYzjG9L4u4S5IV0f/1A==" -> null
-       md5hexhash          = "7a8b316338c6f4be2ee12e485747ffd4" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2Fdbt_run_and_upload_artifacts.yml?generation=1751485822740512&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/transform_warehouse/dbt_run_and_upload_artifacts.yml" -> null
-       output_name         = "dags/transform_warehouse/dbt_run_and_upload_artifacts.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2Fdbt_run_and_upload_artifacts.yml" -> null
-       source              = "../../../../airflow/dags/transform_warehouse/dbt_run_and_upload_artifacts.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/dbt_test.yml"] will be destroyed
  # (because key ["dags/transform_warehouse/dbt_test.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "H4NkCg==" -> null
-       detect_md5hash      = "FouUSkAANNBrkR8YlEDyLA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416050156728 -> null
-       id                  = "calitp-staging-composer-dags/transform_warehouse/dbt_test.yml" -> null
-       md5hash             = "FouUSkAANNBrkR8YlEDyLA==" -> null
-       md5hexhash          = "168b944a400034d06b911f189440f22c" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2Fdbt_test.yml?generation=1751416050156728&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/transform_warehouse/dbt_test.yml" -> null
-       output_name         = "dags/transform_warehouse/dbt_test.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2Fdbt_test.yml" -> null
-       source              = "../../../../airflow/dags/transform_warehouse/dbt_test.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/METADATA.yml"] will be destroyed
  # (because key ["dags/transform_warehouse_full_refresh/METADATA.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "pSESjw==" -> null
-       detect_md5hash      = "UgjlNpFGtU41GlVohkyE7g==" -> null
-       event_based_hold    = false -> null
-       generation          = 1752012528714346 -> null
-       id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh/METADATA.yml" -> null
-       md5hash             = "UgjlNpFGtU41GlVohkyE7g==" -> null
-       md5hexhash          = "5208e5369146b54e351a5568864c84ee" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2FMETADATA.yml?generation=1752012528714346&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/transform_warehouse_full_refresh/METADATA.yml" -> null
-       output_name         = "dags/transform_warehouse_full_refresh/METADATA.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2FMETADATA.yml" -> null
-       source              = "../../../../airflow/dags/transform_warehouse_full_refresh/METADATA.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/README.md"] will be destroyed
  # (because key ["dags/transform_warehouse_full_refresh/README.md"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "xka7Bg==" -> null
-       detect_md5hash      = "dfoFKUv8C4kOuPBSWmwNNQ==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751485822736989 -> null
-       id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh/README.md" -> null
-       md5hash             = "dfoFKUv8C4kOuPBSWmwNNQ==" -> null
-       md5hexhash          = "75fa05294bfc0b890eb8f0525a6c0d35" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2FREADME.md?generation=1751485822736989&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/transform_warehouse_full_refresh/README.md" -> null
-       output_name         = "dags/transform_warehouse_full_refresh/README.md" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2FREADME.md" -> null
-       source              = "../../../../airflow/dags/transform_warehouse_full_refresh/README.md" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"] will be destroyed
  # (because key ["dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "DUC0og==" -> null
-       detect_md5hash      = "VyW21SypkxM2yjLri8T9Xw==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751485822725663 -> null
-       id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml" -> null
-       md5hash             = "VyW21SypkxM2yjLri8T9Xw==" -> null
-       md5hexhash          = "5725b6d52ca9931336ca32eb8bc4fd5f" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2Fdbt_run_and_upload_artifacts.yml?generation=1751485822725663&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml" -> null
-       output_name         = "dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2Fdbt_run_and_upload_artifacts.yml" -> null
-       source              = "../../../../airflow/dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/dbt_test.yml"] will be destroyed
  # (because key ["dags/transform_warehouse_full_refresh/dbt_test.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "q7AdIw==" -> null
-       detect_md5hash      = "7xSa1VEHgG31ghW+WD5pdw==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416050059303 -> null
-       id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh/dbt_test.yml" -> null
-       md5hash             = "7xSa1VEHgG31ghW+WD5pdw==" -> null
-       md5hexhash          = "ef149ad55107806df58215be583e6977" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2Fdbt_test.yml?generation=1751416050059303&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/transform_warehouse_full_refresh/dbt_test.yml" -> null
-       output_name         = "dags/transform_warehouse_full_refresh/dbt_test.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2Fdbt_test.yml" -> null
-       source              = "../../../../airflow/dags/transform_warehouse_full_refresh/dbt_test.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/METADATA.yml"] will be destroyed
  # (because key ["dags/transform_warehouse_full_refresh_sunday/METADATA.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "Cv1Cgw==" -> null
-       detect_md5hash      = "P5ABkJiLwJG1zwkpbZUgew==" -> null
-       event_based_hold    = false -> null
-       generation          = 1752012529721732 -> null
-       id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/METADATA.yml" -> null
-       md5hash             = "P5ABkJiLwJG1zwkpbZUgew==" -> null
-       md5hexhash          = "3f900190988bc091b5cf09296d95207b" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2FMETADATA.yml?generation=1752012529721732&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/transform_warehouse_full_refresh_sunday/METADATA.yml" -> null
-       output_name         = "dags/transform_warehouse_full_refresh_sunday/METADATA.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2FMETADATA.yml" -> null
-       source              = "../../../../airflow/dags/transform_warehouse_full_refresh_sunday/METADATA.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/README.md"] will be destroyed
  # (because key ["dags/transform_warehouse_full_refresh_sunday/README.md"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "71fzIQ==" -> null
-       detect_md5hash      = "97NIfH78kp9Qsefw+S/xFA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751485822818973 -> null
-       id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/README.md" -> null
-       md5hash             = "97NIfH78kp9Qsefw+S/xFA==" -> null
-       md5hexhash          = "f7b3487c7efc929f50b1e7f0f92ff114" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2FREADME.md?generation=1751485822818973&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/transform_warehouse_full_refresh_sunday/README.md" -> null
-       output_name         = "dags/transform_warehouse_full_refresh_sunday/README.md" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2FREADME.md" -> null
-       source              = "../../../../airflow/dags/transform_warehouse_full_refresh_sunday/README.md" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"] will be destroyed
  # (because key ["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "lpo4KQ==" -> null
-       detect_md5hash      = "t4dlQ4mkxjU6Cr2r/t7YGw==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751485822728669 -> null
-       id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml" -> null
-       md5hash             = "t4dlQ4mkxjU6Cr2r/t7YGw==" -> null
-       md5hexhash          = "b787654389a4c6353a0abdabfeded81b" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml?generation=1751485822728669&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml" -> null
-       output_name         = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml" -> null
-       source              = "../../../../airflow/dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"] will be destroyed
  # (because key ["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "ue2ydg==" -> null
-       detect_md5hash      = "GeCgM2T4uEKLSZGGNvpCUA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751485822730175 -> null
-       id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml" -> null
-       md5hash             = "GeCgM2T4uEKLSZGGNvpCUA==" -> null
-       md5hexhash          = "19e0a03364f8b8428b49918636fa4250" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_run_and_upload_artifacts_select_rt.yml?generation=1751485822730175&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml" -> null
-       output_name         = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_run_and_upload_artifacts_select_rt.yml" -> null
-       source              = "../../../../airflow/dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"] will be destroyed
  # (because key ["dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "MtpAFg==" -> null
-       detect_md5hash      = "V+KHT2/A37WtMuMEGGosxg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416049317511 -> null
-       id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml" -> null
-       md5hash             = "V+KHT2/A37WtMuMEGGosxg==" -> null
-       md5hexhash          = "57e2874f6fc0dfb5ad32e304186a2cc6" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_test_exclude_rt.yml?generation=1751416049317511&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml" -> null
-       output_name         = "dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_test_exclude_rt.yml" -> null
-       source              = "../../../../airflow/dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"] will be destroyed
  # (because key ["dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "1zJXSA==" -> null
-       detect_md5hash      = "QMcwLpE+GqH075eTyG9vPQ==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416049285934 -> null
-       id                  = "calitp-staging-composer-dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml" -> null
-       md5hash             = "QMcwLpE+GqH075eTyG9vPQ==" -> null
-       md5hexhash          = "40c7302e913e1aa1f4ef9793c86f6f3d" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_test_select_rt.yml?generation=1751416049285934&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml" -> null
-       output_name         = "dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_test_select_rt.yml" -> null
-       source              = "../../../../airflow/dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "T9xLgw==" -> (known after apply)
!~      detect_md5hash      = "RZff0J+b/Jka5frQF+tGBw==" -> "different hash"
!~      generation          = 1752103418450207 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "RZff0J+b/Jka5frQF+tGBw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/generate_schema_name.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "a6qEjw==" -> (known after apply)
!~      detect_md5hash      = "bZhhIVi3qA4oUdmiy2tAIg==" -> "different hash"
!~      generation          = 1749663113365920 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/generate_schema_name.sql"
!~      md5hash             = "bZhhIVi3qA4oUdmiy2tAIg==" -> (known after apply)
        name                = "data/warehouse/macros/generate_schema_name.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["packages.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "d7CHDg==" -> (known after apply)
!~      detect_md5hash      = "YbInpjdPPT/rrfBww3SDnw==" -> "different hash"
!~      generation          = 1751478658504547 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/packages.yml"
!~      md5hash             = "YbInpjdPPT/rrfBww3SDnw==" -> (known after apply)
        name                = "data/warehouse/packages.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "2RBKew==" -> (known after apply)
!~      detect_md5hash      = "GBSeTJZJB4kNiTmdZKGGYA==" -> "different hash"
!~      generation          = 1752103419653909 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "GBSeTJZJB4kNiTmdZKGGYA==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "KvxdLg==" -> (known after apply)
!~      detect_md5hash      = "kh10Bt2VtvG+0yNnA5q1/Q==" -> "different hash"
!~      generation          = 1752103419390838 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "kh10Bt2VtvG+0yNnA5q1/Q==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 16 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #229](https://github.com/cal-itp/data-infra/actions/runs/16207209362)